#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_registry.ngc will be created
  + resource "azurerm_container_registry" "ngc" {
      + admin_enabled       = false
      + admin_password      = (sensitive value)
      + admin_username      = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + login_server        = (known after apply)
      + name                = "NextGenConf"
      + network_rule_set    = (known after apply)
      + resource_group_name = "ngc"
      + sku                 = "Standard"
      + tags                = (known after apply)
    }

  # azurerm_resource_group.ngc will be created
  + resource "azurerm_resource_group" "ngc" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "ngc"
      + tags     = (known after apply)
    }

  # github_repository.repository_api_gateway will be updated in-place
  ~ resource "github_repository" "repository_api_gateway" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for aggregating requests to storage services"
        etag               = "W/\"cff9d2c2f2b3d160cc2573456b050822\""
        full_name          = "NextGenConf/ApiGateway"
        git_clone_url      = "git://github.com/NextGenConf/ApiGateway.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ApiGateway"
        http_clone_url     = "https://github.com/NextGenConf/ApiGateway.git"
        id                 = "ApiGateway"
        license_template   = "mit"
        name               = "ApiGateway"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ApiGateway.git"
        svn_url            = "https://github.com/NextGenConf/ApiGateway"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_service will be updated in-place
  ~ resource "github_repository" "repository_conference_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "Microservice for storing conferences"
        etag               = "W/\"fadda49fc021ed93bbfc7e774dc8e893\""
        full_name          = "NextGenConf/ConferenceService"
        git_clone_url      = "git://github.com/NextGenConf/ConferenceService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ConferenceService"
        http_clone_url     = "https://github.com/NextGenConf/ConferenceService.git"
        id                 = "ConferenceService"
        name               = "ConferenceService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ConferenceService.git"
        svn_url            = "https://github.com/NextGenConf/ConferenceService"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_session_service will be updated in-place
  ~ resource "github_repository" "repository_conference_session_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing the relationship between conferences and sessions"
        etag               = "W/\"c5cccbf05ba67fb608ad42a1c5f02871\""
        full_name          = "NextGenConf/ConferenceSessionService"
        git_clone_url      = "git://github.com/NextGenConf/ConferenceSessionService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ConferenceSessionService"
        http_clone_url     = "https://github.com/NextGenConf/ConferenceSessionService.git"
        id                 = "ConferenceSessionService"
        license_template   = "mit"
        name               = "ConferenceSessionService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ConferenceSessionService.git"
        svn_url            = "https://github.com/NextGenConf/ConferenceSessionService"
      - topics             = [] -> null
    }

  # github_repository.repository_feed_service will be updated in-place
  ~ resource "github_repository" "repository_feed_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference feeds"
        etag               = "W/\"14599e2e6a8a49d5e25741e6e8428a9c\""
        full_name          = "NextGenConf/FeedService"
        git_clone_url      = "git://github.com/NextGenConf/FeedService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/FeedService"
        http_clone_url     = "https://github.com/NextGenConf/FeedService.git"
        id                 = "FeedService"
        license_template   = "mit"
        name               = "FeedService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/FeedService.git"
        svn_url            = "https://github.com/NextGenConf/FeedService"
      - topics             = [] -> null
    }

  # github_repository.repository_k8s_config will be created
  + resource "github_repository" "repository_k8s_config" {
      + allow_merge_commit = false
      + allow_rebase_merge = false
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "Repository containing the kubernetes resource files for the NextGenConf cluster"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_issues         = true
      + has_projects       = false
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + license_template   = "mit"
      + name               = "KubeConfig"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # github_repository.repository_session_service will be updated in-place
  ~ resource "github_repository" "repository_session_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference sessions"
        etag               = "W/\"894fc9f8ef3aa49c53caa7a59ed2a2b0\""
        full_name          = "NextGenConf/SessionService"
        git_clone_url      = "git://github.com/NextGenConf/SessionService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/SessionService"
        http_clone_url     = "https://github.com/NextGenConf/SessionService.git"
        id                 = "SessionService"
        license_template   = "mit"
        name               = "SessionService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/SessionService.git"
        svn_url            = "https://github.com/NextGenConf/SessionService"
      - topics             = [] -> null
    }

  # github_repository.repository_web_app will be updated in-place
  ~ resource "github_repository" "repository_web_app" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "React app displaying conferences"
        etag               = "W/\"292535c1f9ce297dcc6d4047b22dfcfd\""
        full_name          = "NextGenConf/WebApp"
        git_clone_url      = "git://github.com/NextGenConf/WebApp.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/WebApp"
        http_clone_url     = "https://github.com/NextGenConf/WebApp.git"
        id                 = "WebApp"
        name               = "WebApp"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/WebApp.git"
        svn_url            = "https://github.com/NextGenConf/WebApp"
      - topics             = [] -> null
    }

Plan: 3 to add, 6 to change, 0 to destroy.
```

</details>

*Workflow: `ci pr`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
